<a href="https://colab.research.google.com/github/sairam178/Foundation-of-machine-learning/blob/main/exercise1_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [176]:
import pandas as pd

In [177]:
data = {
    "name": ["Aman","Saurav","karan","shubham","abhishek",None,"Sammer"],
    "age": [22,23,None,22,25,24,26],
    "marks":[85,None,88,90,56,72,None],
    "subject":["math","physics","math","chemistry","math","physics","chemistry"]

}
df = pd.DataFrame(data)
print(df)

       name   age  marks    subject
0      Aman  22.0   85.0       math
1    Saurav  23.0    NaN    physics
2     karan   NaN   88.0       math
3   shubham  22.0   90.0  chemistry
4  abhishek  25.0   56.0       math
5      None  24.0   72.0    physics
6    Sammer  26.0    NaN  chemistry

In [178]:
print(df.describe())

             age      marks
count   6.000000   5.000000
mean   23.666667  78.200000
std     1.632993  14.254824
min    22.000000  56.000000
25%    22.250000  72.000000
50%    23.500000  85.000000
75%    24.750000  88.000000
max    26.000000  90.000000

In [179]:
print(df.dtypes)

name        object
age        float64
marks      float64
subject     object
dtype: object

In [180]:
print(df.shape)

(7, 4)

In [181]:
print(df[["name","marks"]])

       name  marks
0      Aman   85.0
1    Saurav    NaN
2     karan   88.0
3   shubham   90.0
4  abhishek   56.0
5      None   72.0
6    Sammer    NaN

In [182]:
print(df["marks"]>80)

0     True
1    False
2     True
3     True
4    False
5    False
6    False
Name: marks, dtype: bool

In [183]:
df[(df["age"]>=22) & (df["marks"]>80) ]

      name   age  marks    subject
0     Aman  22.0   85.0       math
3  shubham  22.0   90.0  chemistry

In [184]:
df["subject"].value_counts()

subject
math         3
physics      2
chemistry    2
Name: count, dtype: int64

In [185]:
df.sort_values("marks",ascending=False)

       name   age  marks    subject
3   shubham  22.0   90.0  chemistry
2     karan   NaN   88.0       math
0      Aman  22.0   85.0       math
5      None  24.0   72.0    physics
4  abhishek  25.0   56.0       math
1    Saurav  23.0    NaN    physics
6    Sammer  26.0    NaN  chemistry

In [186]:
top = df["marks"].nlargest(2)
print(top)

3    90.0
2    88.0
Name: marks, dtype: float64

In [187]:
lowest_mark = df['marks'].min()
lowest_marks_students = df[df['marks'] == lowest_mark]
print(lowest_marks_students)

       name   age  marks subject
4  abhishek  25.0   56.0    math

In [188]:
print('Missing values before handling:')
print(df.isnull().sum())

Missing values before handling:
name       1
age        1
marks      2
subject    0
dtype: int64

In [189]:
cleaned_df = df.dropna()
print('DataFrame after removing rows with any missing values:')
print(cleaned_df)
print('\nMissing values in cleaned_df:')
print(cleaned_df.isnull().sum())

DataFrame after removing rows with any missing values:
       name   age  marks    subject
0      Aman  22.0   85.0       math
3   shubham  22.0   90.0  chemistry
4  abhishek  25.0   56.0       math

Missing values in cleaned_df:
name       0
age        0
marks      0
subject    0
dtype: int64

In [190]:
missing_marks_rows = df[df['marks'].isnull()]
print('Rows with missing marks:')
print(missing_marks_rows)

Rows with missing marks:
     name   age  marks    subject
1  Saurav  23.0    NaN    physics
6  Sammer  26.0    NaN  chemistry

In [191]:
print('Shape of original DataFrame (df):', df.shape)
print('Shape of cleaned DataFrame (cleaned_df):', cleaned_df.shape)

Shape of original DataFrame (df): (7, 4)
Shape of cleaned DataFrame (cleaned_df): (3, 4)

In [192]:
df.describe()

             age      marks
count   6.000000   5.000000
mean   23.666667  78.200000
std     1.632993  14.254824
min    22.000000  56.000000
25%    22.250000  72.000000
50%    23.500000  85.000000
75%    24.750000  88.000000
max    26.000000  90.000000

GroupBy in pandas

In [193]:
data = {
    "name": ["Aman","Saurav","karan","shubham","abhishek",None,"Sammer"],
    "age": [22,23,None,22,25,24,26],
    "marks":[85,None,88,90,56,72,None],
    "subject":["math","physics","math","chemistry","math","physics","chemistry"]

}
df = pd.DataFrame(data)
print(df)

       name   age  marks    subject
0      Aman  22.0   85.0       math
1    Saurav  23.0    NaN    physics
2     karan   NaN   88.0       math
3   shubham  22.0   90.0  chemistry
4  abhishek  25.0   56.0       math
5      None  24.0   72.0    physics
6    Sammer  26.0    NaN  chemistry

In [194]:
df.groupby("subject")["marks"].sum()

subject
chemistry     90.0
math         229.0
physics       72.0
Name: marks, dtype: float64

In [195]:
df.groupby("subject")["marks"].mean().max()

90.0

In [196]:
df.groupby("name")["marks"].apply(lambda x: x.isnull().sum())

name
Aman        0
Sammer      1
Saurav      1
abhishek    0
karan       0
shubham     0
Name: marks, dtype: int64

In [197]:
df.groupby('subject')['name'].count()

subject
chemistry    2
math         3
physics      1
Name: name, dtype: int64

In [198]:
df.groupby('subject')['marks'].agg(["max","mean","min"])

            max       mean   min
subject
chemistry  90.0  90.000000  90.0
math       88.0  76.333333  56.0
physics    72.0  72.000000  72.0

In [199]:
df.groupby(['subject','name'])["marks"].mean()

subject    name
chemistry  Sammer       NaN
           shubham     90.0
math       Aman        85.0
           abhishek    56.0
           karan       88.0
physics    Saurav       NaN
Name: marks, dtype: float64

Activity 2

In [200]:
data = {
    "name":["sairam","sriram","sreekiran","shiva","teja","varsha","sathwika","umesh","saideepak","saiteja"],
    "department":["IT",'SALES','HR','IT','SALES','HR','HR','SALES','IT','SALES'],
    "role":['ML SPECIALIST','ANAYLST','DEVELOPER','MANGER','ML SPECIALIST','ANAYLST','DEVELOPER','MANGER','DATA SCEINTIST','DATA SCEINTIST'],
    "experience":[20,1,3,4,5,2,3,4,2,7],
    "salary":[100000,50000,None,55245,8855,4574,None,58447,2568,80303],
    "score":[98,45,75,78,None,77,47,57,42,45]

}

df = pd.DataFrame(data)

In [202]:
df.groupby('department')['salary'].mean()

department
HR        4574.000000
IT       52604.333333
SALES    49401.250000
Name: salary, dtype: float64

In [203]:
df.groupby('role')['score'].mean()

role
ANAYLST           61.0
DATA SCEINTIST    43.5
DEVELOPER         61.0
MANGER            67.5
ML SPECIALIST     98.0
Name: score, dtype: float64

In [204]:
df.groupby('department')['score'].count()

department
HR       3
IT       3
SALES    3
Name: score, dtype: int64

In [205]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   department  10 non-null     object
 2   role        10 non-null     object
 3   experience  10 non-null     int64
 4   salary      8 non-null      float64
 5   score       9 non-null      float64
dtypes: float64(2), int64(1), object(3)
memory usage: 612.0+ bytes

In [208]:
df.groupby('department')['salary'].agg(['mean','max','min','count'])

                    mean       max     min  count
department
HR           4574.000000    4574.0  4574.0      1
IT          52604.333333  100000.0  2568.0      3
SALES       49401.250000   80303.0  8855.0      4

In [209]:
df.groupby('role')['salary'].agg(['mean','max','min','count'])

                   mean       max      min  count
role
ANAYLST         27287.0   50000.0   4574.0      2
DATA SCEINTIST  41435.5   80303.0   2568.0      2
DEVELOPER           NaN       NaN      NaN      0
MANGER          56846.0   58447.0  55245.0      2
ML SPECIALIST   54427.5  100000.0   8855.0      2

In [210]:
df.groupby(['department','role'])['salary'].agg(['mean','max','min','count'])

                               mean       max       min  count
department role
HR         ANAYLST           4574.0    4574.0    4574.0      1
           DEVELOPER            NaN       NaN       NaN      0
IT         DATA SCEINTIST    2568.0    2568.0    2568.0      1
           MANGER           55245.0   55245.0   55245.0      1
           ML SPECIALIST   100000.0  100000.0  100000.0      1
SALES      ANAYLST          50000.0   50000.0   50000.0      1
           DATA SCEINTIST   80303.0   80303.0   80303.0      1
           MANGER           58447.0   58447.0   58447.0      1
           ML SPECIALIST     8855.0    8855.0    8855.0      1

In [211]:
df.groupby(['department','experience'])['score'].mean()

department  experience
HR          2             77.0
            3             61.0
IT          2             42.0
            4             78.0
            20            98.0
SALES       1             45.0
            4             57.0
            5              NaN
            7             45.0
Name: score, dtype: float64